cf_billing/Documents/бестУстановитьСхемуДораспределениеОбъемаУК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестУстановитьСхемуДораспределениеОбъемаУК</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестСхемыДораспределенияОбъемовУК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыОД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СхемаРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/бестУстановитьСхемуДораспределениеОбъемаУК/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки
&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Договор) тогда
		бестПользовательскийВводКлиент.ПриИзмененииДоговораКонтрагента(Объект, "ДатаФактическогоСобытия");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район,"Организация");
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧасти

&НаКлиенте
Процедура ОбъектыОДПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ОбъектыОД.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.IDСтроки) Тогда
		ТекДанные.IDСтроки	= Новый УникальныйИдентификатор;
	КонецЕсли;

	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(Элементы.СхемаРасчета,	Неопределено,	ТекДанные.IDСтроки,,"ТочкиУчета");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОДПередУдалением(Элемент, Отказ)
	ТекущиеДанные 			= Элементы.ОбъектыОД.ТекущиеДанные;
	энргРаботаСТочкамиУчетаКлиент.ТочкаУчетаПередУдалением(Объект.СхемаРасчета,ТекущиеДанные,"IDСтрокиТочкиУчета");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОДУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ОбъектыОД.ТекущиеДанные;
	ВыборУслугиИТочкиУчета(ТекДанные, Элемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СхемаРасчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.СхемаРасчета.ТекущиеДанные;
	ВыборУслугиИТочкиУчета(ТекДанные, Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СхемаРасчетаПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.СхемаРасчета.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеТУ = Элементы.ОбъектыОД.ТекущиеДанные;
	Если ТекДанныеТУ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.IDСтрокиТочкиУчета	= ТекДанныеТУ.IDСтроки;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФУнкции
&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные, Элемент, ТолькоУслуги)
	СтруктураОтбора = Новый Структура("Период,Организация,Район,ОбъектРасчета",КонецДня(Объект.Дата));
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,ТекДанные);
	СтруктураОтбора.Период = КонецДня(Объект.Дата);
	Если ТолькоУслуги Тогда
		СтруктураОтбора.ОбъектРасчета = Объект.МКД;
	КонецЕсли;
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора,ТолькоУслуги", СтруктураОтбора, ТолькоУслуги);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("ТекДанные", ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		Модифицированность	= Истина;
		ТекДанные			= ДополнительныеПараметры.ТекДанные;
		ЗаполнитьЗначенияСвойств(ТекДанные, РезультатЗакрытия);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды





#КонецОбласти
